; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	infrared0 - mode
	spectrograph1 - mode
	image2 - mode
	spectrograph3 - mode
	GroundStation4 - direction
	Star5 - direction
	GroundStation10 - direction
	GroundStation0 - direction
	Star7 - direction
	GroundStation9 - direction
	GroundStation3 - direction
	Star1 - direction
	Star2 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 image2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph3)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph3)
	(supports instrument3 image2)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star7)
	(supports instrument4 spectrograph3)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation8)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument5 spectrograph3)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation9)
	(supports instrument6 image2)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star1)
	(supports instrument7 image2)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 GroundStation6)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
)
(:goal (and
	(pointing satellite1 Star5)
	(pointing satellite2 Planet11)
	(pointing satellite3 GroundStation0)
	(have_image Planet11 spectrograph1)
	(have_image Star12 spectrograph1)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon14 spectrograph1)
	(have_image Star15 spectrograph3)
))

)

; plan
1. (turn_to satellite3 groundstation0 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 groundstation0)
   goals met: 1 of 8
2. (turn_to satellite2 groundstation8 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 groundstation8)
   goals met: 1 of 8
3. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 8
4. (calibrate satellite2 instrument4 groundstation8)
   added: (calibrated instrument4)
   goals met: 1 of 8
5. (turn_to satellite2 phenomenon14 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 phenomenon14)
   goals met: 1 of 8
6. (take_image satellite2 phenomenon14 instrument4 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 2 of 8
7. (turn_to satellite2 phenomenon13 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 8
8. (turn_to satellite1 star5 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star5)
   goals met: 3 of 8
9. (take_image satellite2 phenomenon13 instrument4 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 4 of 8
10. (turn_to satellite2 star12 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 star12)
   goals met: 4 of 8
11. (take_image satellite2 star12 instrument4 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 5 of 8
12. (turn_to satellite2 star15 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star15)
   goals met: 5 of 8
13. (take_image satellite2 star15 instrument4 spectrograph3)
   added: (have_image star15 spectrograph3)
   goals met: 6 of 8
14. (turn_to satellite2 planet11 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 planet11)
   goals met: 7 of 8
15. (take_image satellite2 planet11 instrument4 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 8 of 8
